#+title: Emacs Doom Воркшоп 3
#+author: veschin
#+language: ru
*** Random floats
#+begin_src clojure
(repeatedly 3 #(rand 10))
#+end_src

#+RESULTS:
| 6.503512433970936 | 7.362478384334002 | 9.060041267568812 |

*** Read this file title
#+name: pwd*
#+begin_src bash :cache yes
pwd
#+end_src


#+name: read-pwd
#+begin_src clojure :var dir=pwd*
(->> (str dir "/w3.org")
     (slurp)
     (take 29)
     (apply str))
#+end_src

#+RESULTS: read-pwd
: #+title: Emacs Doom Воркшоп 3

*** Python + Clojure
#+name: python
#+begin_src python
list = [x for x in range(10)]
return list
#+end_src

#+RESULTS: python
| 0 | 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 | 9 |

#+name: clojure
#+begin_src clojure :var p=python :results verbatim
(mapv inc p)
#+end_src

#+RESULTS: clojure
: [1 2 3 4 5 6 7 8 9 10]
